app/controllers/senses_controller.rb

    def set_sense
      @sense = Sense.find(params[:id])
---
SELECT  "senses".* FROM "senses" WHERE "senses"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]